; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types
        car - object
        location - object )

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))


   (:action board
       :parameters (?car - car ?loc - location)
       :precondition  (and  (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car - car  ?loc - location)
       :precondition  (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
;; cars=15, locations=12, out_folder=training/easy, instance_id=75, seed=105

(define (problem ferry-75)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc10)
    (at car1 loc6)
    (at car2 loc10)
    (at car3 loc2)
    (at car4 loc1)
    (at car5 loc5)
    (at car6 loc9)
    (at car7 loc10)
    (at car8 loc6)
    (at car9 loc5)
    (at car10 loc3)
    (at car11 loc6)
    (at car12 loc3)
    (at car13 loc3)
    (at car14 loc2)
    (at car15 loc11)
)
 (:goal  (and (at car1 loc8)
   (at car2 loc6)
   (at car3 loc4)
   (at car4 loc8)
   (at car5 loc11)
   (at car6 loc7)
   (at car7 loc8)
   (at car8 loc9)
   (at car9 loc12)
   (at car10 loc5)
   (at car11 loc3)
   (at car12 loc11)
   (at car13 loc6)
   (at car14 loc10)
   (at car15 loc5))))

; plan
1. (sail loc10 loc6)
   deleted: (at-ferry loc10)
   added: (at-ferry loc6)
   goals met: 0 of 15
2. (board car1 loc6)
   deleted: (at car1 loc6) (empty-ferry)
   added: (on car1)
   goals met: 0 of 15
3. (sail loc6 loc8)
   deleted: (at-ferry loc6)
   added: (at-ferry loc8)
   goals met: 0 of 15
4. (debark car1 loc8)
   deleted: (on car1)
   added: (at car1 loc8) (empty-ferry)
   goals met: 1 of 15
5. (sail loc8 loc10)
   deleted: (at-ferry loc8)
   added: (at-ferry loc10)
   goals met: 1 of 15
6. (board car2 loc10)
   deleted: (at car2 loc10) (empty-ferry)
   added: (on car2)
   goals met: 1 of 15
7. (sail loc10 loc6)
   deleted: (at-ferry loc10)
   added: (at-ferry loc6)
   goals met: 1 of 15
8. (debark car2 loc6)
   deleted: (on car2)
   added: (at car2 loc6) (empty-ferry)
   goals met: 2 of 15
9. (sail loc6 loc2)
   deleted: (at-ferry loc6)
   added: (at-ferry loc2)
   goals met: 2 of 15
10. (board car3 loc2)
   deleted: (at car3 loc2) (empty-ferry)
   added: (on car3)
   goals met: 2 of 15
11. (sail loc2 loc4)
   deleted: (at-ferry loc2)
   added: (at-ferry loc4)
   goals met: 2 of 15
12. (debark car3 loc4)
   deleted: (on car3)
   added: (at car3 loc4) (empty-ferry)
   goals met: 3 of 15
13. (sail loc4 loc1)
   deleted: (at-ferry loc4)
   added: (at-ferry loc1)
   goals met: 3 of 15
14. (board car4 loc1)
   deleted: (at car4 loc1) (empty-ferry)
   added: (on car4)
   goals met: 3 of 15
15. (sail loc1 loc8)
   deleted: (at-ferry loc1)
   added: (at-ferry loc8)
   goals met: 3 of 15
16. (debark car4 loc8)
   deleted: (on car4)
   added: (at car4 loc8) (empty-ferry)
   goals met: 4 of 15
17. (sail loc8 loc5)
   deleted: (at-ferry loc8)
   added: (at-ferry loc5)
   goals met: 4 of 15
18. (board car5 loc5)
   deleted: (at car5 loc5) (empty-ferry)
   added: (on car5)
   goals met: 4 of 15
19. (sail loc5 loc11)
   deleted: (at-ferry loc5)
   added: (at-ferry loc11)
   goals met: 4 of 15
20. (debark car5 loc11)
   deleted: (on car5)
   added: (at car5 loc11) (empty-ferry)
   goals met: 5 of 15
21. (sail loc11 loc9)
   deleted: (at-ferry loc11)
   added: (at-ferry loc9)
   goals met: 5 of 15
22. (board car6 loc9)
   deleted: (at car6 loc9) (empty-ferry)
   added: (on car6)
   goals met: 5 of 15
23. (sail loc9 loc7)
   deleted: (at-ferry loc9)
   added: (at-ferry loc7)
   goals met: 5 of 15
24. (debark car6 loc7)
   deleted: (on car6)
   added: (at car6 loc7) (empty-ferry)
   goals met: 6 of 15
25. (sail loc7 loc10)
   deleted: (at-ferry loc7)
   added: (at-ferry loc10)
   goals met: 6 of 15
26. (board car7 loc10)
   deleted: (at car7 loc10) (empty-ferry)
   added: (on car7)
   goals met: 6 of 15
27. (sail loc10 loc8)
   deleted: (at-ferry loc10)
   added: (at-ferry loc8)
   goals met: 6 of 15
28. (debark car7 loc8)
   deleted: (on car7)
   added: (at car7 loc8) (empty-ferry)
   goals met: 7 of 15
29. (sail loc8 loc6)
   deleted: (at-ferry loc8)
   added: (at-ferry loc6)
   goals met: 7 of 15
30. (board car8 loc6)
   deleted: (at car8 loc6) (empty-ferry)
   added: (on car8)
   goals met: 7 of 15
31. (sail loc6 loc9)
   deleted: (at-ferry loc6)
   added: (at-ferry loc9)
   goals met: 7 of 15
32. (debark car8 loc9)
   deleted: (on car8)
   added: (at car8 loc9) (empty-ferry)
   goals met: 8 of 15
33. (sail loc9 loc5)
   deleted: (at-ferry loc9)
   added: (at-ferry loc5)
   goals met: 8 of 15
34. (board car9 loc5)
   deleted: (at car9 loc5) (empty-ferry)
   added: (on car9)
   goals met: 8 of 15
35. (sail loc5 loc12)
   deleted: (at-ferry loc5)
   added: (at-ferry loc12)
   goals met: 8 of 15
36. (debark car9 loc12)
   deleted: (on car9)
   added: (at car9 loc12) (empty-ferry)
   goals met: 9 of 15
37. (sail loc12 loc3)
   deleted: (at-ferry loc12)
   added: (at-ferry loc3)
   goals met: 9 of 15
38. (board car10 loc3)
   deleted: (at car10 loc3) (empty-ferry)
   added: (on car10)
   goals met: 9 of 15
39. (sail loc3 loc5)
   deleted: (at-ferry loc3)
   added: (at-ferry loc5)
   goals met: 9 of 15
40. (debark car10 loc5)
   deleted: (on car10)
   added: (at car10 loc5) (empty-ferry)
   goals met: 10 of 15
41. (sail loc5 loc6)
   deleted: (at-ferry loc5)
   added: (at-ferry loc6)
   goals met: 10 of 15
42. (board car11 loc6)
   deleted: (at car11 loc6) (empty-ferry)
   added: (on car11)
   goals met: 10 of 15
43. (sail loc6 loc3)
   deleted: (at-ferry loc6)
   added: (at-ferry loc3)
   goals met: 10 of 15
44. (debark car11 loc3)
   deleted: (on car11)
   added: (at car11 loc3) (empty-ferry)
   goals met: 11 of 15
45. (board car12 loc3)
   deleted: (at car12 loc3) (empty-ferry)
   added: (on car12)
   goals met: 11 of 15
46. (sail loc3 loc11)
   deleted: (at-ferry loc3)
   added: (at-ferry loc11)
   goals met: 11 of 15
47. (debark car12 loc11)
   deleted: (on car12)
   added: (at car12 loc11) (empty-ferry)
   goals met: 12 of 15
48. (sail loc11 loc3)
   deleted: (at-ferry loc11)
   added: (at-ferry loc3)
   goals met: 12 of 15
49. (board car13 loc3)
   deleted: (at car13 loc3) (empty-ferry)
   added: (on car13)
   goals met: 12 of 15
50. (sail loc3 loc6)
   deleted: (at-ferry loc3)
   added: (at-ferry loc6)
   goals met: 12 of 15
51. (debark car13 loc6)
   deleted: (on car13)
   added: (at car13 loc6) (empty-ferry)
   goals met: 13 of 15
52. (sail loc6 loc2)
   deleted: (at-ferry loc6)
   added: (at-ferry loc2)
   goals met: 13 of 15
53. (board car14 loc2)
   deleted: (at car14 loc2) (empty-ferry)
   added: (on car14)
   goals met: 13 of 15
54. (sail loc2 loc10)
   deleted: (at-ferry loc2)
   added: (at-ferry loc10)
   goals met: 13 of 15
55. (debark car14 loc10)
   deleted: (on car14)
   added: (at car14 loc10) (empty-ferry)
   goals met: 14 of 15
56. (sail loc10 loc11)
   deleted: (at-ferry loc10)
   added: (at-ferry loc11)
   goals met: 14 of 15
57. (board car15 loc11)
   deleted: (at car15 loc11) (empty-ferry)
   added: (on car15)
   goals met: 14 of 15
58. (sail loc11 loc5)
   deleted: (at-ferry loc11)
   added: (at-ferry loc5)
   goals met: 14 of 15
59. (debark car15 loc5)
   deleted: (on car15)
   added: (at car15 loc5) (empty-ferry)
   goals met: 15 of 15
